//---------------------------------------------------------------------------
//! @file   ComponentHP.h
//! @brief  HPコンポーネント
//---------------------------------------------------------------------------
#include <System/Scene.h>
#include <System/Component/Component.h>
#include <System/Component/ComponentModel.h>
#include <System/Utils/IniFileLib.h>

namespace LittleQuest {
//////////////////////////////////////////////////////////////
//! @brief HPコンポーネントクラス
//////////////////////////////////////////////////////////////
class ComponentHP: public Component {
   public:
    BP_COMPONENT_DECL(ComponentHP, u8"HPコンポーネント");
    //! HPゲージタイプの列挙型
    enum HP_TYPE {
        PLAYER,    //!< プレイヤー
        BOSS,      //!< ボス
        MOB,       //!< 雑魚
        NONE,
    };

    //------------------------------------------------------------
    //! @brief 更新処理を行います。
    //------------------------------------------------------------
    void Update() override;

    //------------------------------------------------------------
    //! @brief ゲージのタイプを設定します。
    //!
    //! @param type HPゲージ列挙型のタイプ
    //------------------------------------------------------------
    void SetType(HP_TYPE type);

    //------------------------------------------------------------
    //! @brief 最大のHP量を設定します。
    //!
    //! @param HP 最大のHP量
    //------------------------------------------------------------
    void SetHP(int HP);

    //------------------------------------------------------------
    //! @brief 現在のHP量を取得します。
    //!
    //! @return 現在のHP量
    //------------------------------------------------------------
    int GetHP();

    //------------------------------------------------------------
    //! @brief HPのパーセントを取得します。
    //!
    //! @return 現在のHPのパーセント
    //------------------------------------------------------------
    float GetHPRate();

    //------------------------------------------------------------
    //! @brief ダメージの計算を行います。
    //!
    //! @param damage ダメージ量
    //------------------------------------------------------------
    void TakeDamage(int damage);

    //------------------------------------------------------------
    //! @brief HPゲージを描画します。
    //------------------------------------------------------------
    void DrawHPBar();

   private:
    //! ダメージアニメーションを表示する時間
    const float DAMAGE_TIME = 60.0f;

    //! HPゲージのタイプ
    HP_TYPE _type        = HP_TYPE::NONE;
    //! ゲージを描画する座標
    VECTOR  _pos2D       = {0, 0, 0};
    //! 最大HP量
    int     _maxHP       = 100;
    //! 現在のHP量
    int     _currHP      = _maxHP;
    //! ゲージ裏のHP量（ダメージアニメーション）
    float   _backHP      = (float)_maxHP;
    //! ダメージアニメーションのタイマー
    float   _damageTimer = 0;
    //! アニメーション中なのか
    bool    _decreasing  = false;

    //--------------------------------------------------------------------
    //! @name Cereal処理
    //--------------------------------------------------------------------
    //@{

    //! @brief セーブ
    // @param arc アーカイバ
    // @param ver バージョン
    CEREAL_SAVELOAD(arc, ver) {
        arc(cereal::make_nvp("Component", cereal::base_class<Component>(this)));
    }
};
}    // namespace LittleQuest
